scalar-transport/flow_1.00/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       79600;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          200;
        startFace       79800;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    topWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80000;
    }
    bottomWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          200;
        startFace       80200;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          80000;
        startFace       80400;
    }
)

// ************************************************************************* //
