scalar-transport/flow_1.00/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
type sets;
libs ("libsampling.so");

setFormat raw;
surfaceFormat vtk;
interpolationScheme cellPoint;

fields
(
    U
    nut
    p
);

sets
(
    line_y0p5
    {
        type        midPointAndFace;
        axis        x;
        start       (-1 0.5 0.05);
        end         (9 0.5 0.05);
    }
    line_y1p5
    {
        type        midPointAndFace;
        axis        x;
        start       (0 1.5 0.05);
        end         (9 1.5 0.05);
    }
    line_y2p5
    {
        type        midPointAndFace;
        axis        x;
        start       (0 2.5 0.05);
        end         (9 2.5 0.05);
    }
    line_x0
    {
        type        midPoint;
        axis        y;
        start       (0.00001 -1  0.05);
        end         (0.00001 4  0.05);
    }
    line_x0p5
    {
        type        midPoint;
        axis        y;
        start       (0.5 -1  0.05);
        end         (0.5 4  0.05);
    }
    line_x1
    {
        type        midPoint;
        axis        y;
        start       (1.00001 -1  0.05);
        end         (1.00001 3.036  0.05);
    }
    line_x2
    {
        type        midPoint;
        axis        y;
        start       (2.00001 -1  0.05);
        end         (2.00001 3.036  0.05);
    }
    line_x3
    {
        type        midPoint;
        axis        y;
        start       (3 1e-3  0.05);
        end         (3 3.036  0.05);
    }
    line_x4
    {
        type        midPoint;
        axis        y;
        start       (4.00001 2e-5  0.05);
        end         (4.00001 3.03  0.05);
    }
    line_x5
    {
        type        midPoint;
        axis        y;
        start       (5 -1  0.05);
        end         (5 3.03  0.05);
    }
    line_x6
    {
        type        midPoint;
        axis        y;
        start       (6 -1  0.05);
        end         (6 3.036  0.05);
    }
    line_x7
    {
        type        midPoint;
        axis        y;
        start       (7 -1  0.05);
        end         (7 3.036  0.05);
    }
    line_x8
    {
        type        midPoint;
        axis        y;
        start       (8 -1  0.05);
        end         (8 3.036  0.05);
    }
    line_x9
    {
        type        midPoint;
        axis        y;
        start       (8.99999 -1  0.05);
        end         (8.99999 4  0.05);
    }
);

surfaces
(

);

// *********************************************************************** //
